Autodesk.Revit.DB.BarTypeDiameterOptions.BarMassPerUnitLength
Represents the bar mass per unit length of the RebarBarType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for barMassPerUnitLength must be non-negative.
Since:
2027